In [3]:
import pandas as pd
import psycopg2
from sqlalchemy import create_engine

In [5]:
engine = create_engine('postgresql://user:password@localhost:5432/Employee_DB')
connection = engine.connect()
df = pd.read_sql('select * from department_employee',con=engine)
df

        emp_no dept_no
0        10001    d005
1        10002    d007
2        10003    d004
3        10004    d004
4        10005    d003
...        ...     ...
331598  499995    d004
331599  499996    d004
331600  499997    d005
331601  499998    d002
331602  499999    d004

[331603 rows x 2 columns]